In [1]:
import pandas as pd

In [118]:
df= pd.read_csv("titanic.csv")

In [119]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [120]:
df.drop(["PassengerId","Name","SibSp","Parch","Ticket","Cabin","Embarked"],axis=1,inplace=True)

In [121]:
df

     Pclass     Sex   Age     Fare  Survived
0         3    male  22.0   7.2500         0
1         1  female  38.0  71.2833         1
2         3  female  26.0   7.9250         1
3         1  female  35.0  53.1000         1
4         3    male  35.0   8.0500         0
..      ...     ...   ...      ...       ...
886       2    male  27.0  13.0000         0
887       1  female  19.0  30.0000         1
888       3  female   NaN  23.4500         0
889       1    male  26.0  30.0000         1
890       3    male  32.0   7.7500         0

[891 rows x 5 columns]

In [122]:
df["Sex"] = df.Sex.map({"male":1,"female":2})

In [123]:
df

     Pclass  Sex   Age     Fare  Survived
0         3    1  22.0   7.2500         0
1         1    2  38.0  71.2833         1
2         3    2  26.0   7.9250         1
3         1    2  35.0  53.1000         1
4         3    1  35.0   8.0500         0
..      ...  ...   ...      ...       ...
886       2    1  27.0  13.0000         0
887       1    2  19.0  30.0000         1
888       3    2   NaN  23.4500         0
889       1    1  26.0  30.0000         1
890       3    1  32.0   7.7500         0

[891 rows x 5 columns]

In [124]:
inputs = df.drop(["Survived"],axis=1)
target = df["Survived"]

In [125]:
inputs.columns[inputs.isna().any()] # to check the null values in columns.So here Age column has NaN value.

Index(['Age'], dtype='object')

#### Handling the NaN values.

In [126]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())

In [128]:
inputs.Age # NaN values are removed.

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

In [130]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [131]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [132]:
model.fit(X_train,y_train)

GaussianNB()

In [133]:
model.score(X_test,y_test)

0.746268656716418

In [134]:
X_test[0:10]

     Pclass  Sex        Age      Fare
78        2    1   0.830000   29.0000
874       2    2  28.000000   24.0000
442       3    1  25.000000    7.7750
700       1    2  18.000000  227.5250
81        3    1  29.000000    9.5000
704       3    1  26.000000    7.8542
149       2    1  42.000000   13.0000
547       2    1  29.699118   13.8625
876       3    1  20.000000    9.8458
879       1    2  56.000000   83.1583

In [135]:
y_test[0:10]

78     1
874    1
442    0
700    1
81     1
704    0
149    0
547    1
876    0
879    1
Name: Survived, dtype: int64

In [136]:
model.predict(X_test[0:10])

array([0, 1, 0, 1, 0, 0, 0, 0, 0, 1], dtype=int64)

In [137]:
model.predict_proba(X_test[:10])

array([[8.18207568e-01, 1.81792432e-01],
       [3.51513148e-01, 6.48486852e-01],
       [9.70492475e-01, 2.95075248e-02],
       [6.08955243e-11, 1.00000000e+00],
       [9.72129898e-01, 2.78701015e-02],
       [9.70943246e-01, 2.90567539e-02],
       [9.29483839e-01, 7.05161612e-02],
       [9.34318467e-01, 6.56815331e-02],
       [9.67604193e-01, 3.23958070e-02],
       [7.89438059e-03, 9.92105619e-01]])

In [138]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.832     , 0.792     , 0.704     , 0.71774194, 0.7016129 ])